//
//обработка символов и строк
//
#ifndef __STR_C
#define __STR_C
#include "str.h"

int str_findsub(char *Fdata,char *s){
 char find=0;
 int Fc;
 int sc;
 Fc=0;
 while(Fdata[Fc] && !find){
  sc=0;
  while(Fdata[Fc+sc] && s[sc] && Fdata[Fc+sc]==s[sc]){
   sc++;
   };
  if(!s[sc]) find=1;
  else       Fc++;
  };
 if(find)return(Fc);
 else    return(-1);
 };




////////////////////////////////////////////////
//приведение к верхнему регистру символов от 0 до 127
//вход:
//chr           -символ
//выход:
//=символ
////////////////////////////////////////////////
char str_char_ENGup(char chr)
{
    return 0;
}

/////////////////////////////////////////////////
//проверка первого вхождения символа
//вход:
//*s            -строка с символами
//chr           -проверяемый символ
//выход:
//=<x>          -символ chr входит в строку s в позиции <x>
//=-1           -символ chr НЕ входит в строку s
/////////////////////////////////////////////////
int str_char_find1st(char *s,char chr)
{
    return 0;
}

//
//строку в число
//

/////////////////////////////////////////////////
//преобразование BIN-строки в WORD-число
//примечание:
// допустимые символы: 0|1
// на любом другом символе преобразование заканчивается
//вход:
//*str          -BIN-строка
//выход:
//*value        -16-битное число
//=количество_обработаных_символов
// если >16 , возможно число преобразовано неправильно
/////////////////////////////////////////////////
int str_strBIN2WORD(short *value,char *str)
{
    return 0;
}

/////////////////////////////////////////////////
//преобразование BIN-строки в DWORD-число
//примечание:
// допустимые символы: 0|1
// на любом другом символе преобразование заканчивается
//вход:
//*str          -BIN-строка
//выход:
//*value        -32-битное число
//=количество_обработаных_символов
// если >32 , возможно число преобразовано неправильно
/////////////////////////////////////////////////
int str_strBIN2DWORD(long *value,char *str)
{
    return 0;
}

/////////////////////////////////////////////////
//преобразование HEX-строки в BYTE-число
//примечание:
// допустимые символы: 0|1|2|3|4|5|6|7|8|9|A|B|C|D|E|F|a|b|c|d|e|f
// на любом другом символе преобразование заканчивается
//вход:
//*str          -HEX-строка
//выход:
//*value        -8-битное число
//=количество_обработаных_символов
// если >2 , возможно число преобразовано неправильно
/////////////////////////////////////////////////
int str_strHEX2BYTE(char *value,char *str)
{
    return 0;
}

/////////////////////////////////////////////////
//преобразование HEX-строки в WORD-число
//примечание:
// допустимые символы: 0|1|2|3|4|5|6|7|8|9|A|B|C|D|E|F|a|b|c|d|e|f
// на любом другом символе преобразование заканчивается
//вход:
//*str          -HEX-строка
//выход:
//*value        -16-битное число
//=количество_обработаных_символов
// если >4 , возможно число преобразовано неправильно
/////////////////////////////////////////////////
int str_strHEX2WORD(short *value,char *str)
{
    return 0;
}

/////////////////////////////////////////////////
//преобразование HEX-строки в DWORD-число
//примечание:
// допустимые символы: 0|1|2|3|4|5|6|7|8|9|A|B|C|D|E|F|a|b|c|d|e|f
// на любом другом символе преобразование заканчивается
//вход:
//*str          -HEX-строка
//выход:
//*value        -32-битное число
//=количество_обработаных_символов
// если >8 , возможно число преобразовано неправильно
/////////////////////////////////////////////////
int str_strHEX2DWORD(long *value,char *str)
{
    return 0;
}

/////////////////////////////////////////////////
//преобразование DEC-строки в WORD-число
//примечание:
// допустимые символы: 0|1|2|3|4|5|6|7|8|9
//  перед числом: +|-
// на любом другом символе преобразование заканчивается
//вход:
//*str          -DEC-строка
//выход:
//*value        -16-битное число
//=количество_обработаных_символов
// если >5 или >6, возможно число преобразовано неправильно
/////////////////////////////////////////////////
int str_strDEC2WORD(short *value,char *str)
{
    return 0;
}

/////////////////////////////////////////////////
//преобразование DEC-строки в DWORD-число
//примечание:
// допустимые символы: 0|1|2|3|4|5|6|7|8|9
//  перед числом: +|-
// на любом другом символе преобразование заканчивается
//вход:
//*str          -DEC-строка
//выход:
//=32-битное число
/////////////////////////////////////////////////
long str_strDEC2DWORD(char *str)
{
    return 0;
}

//
//число в строку
//

/////////////////////////////////////////////////
//преобразует BYTE-число в BIN-строку
//вход:
//value         -число
//выход:
//*str          -BIN-строка
//=str
/////////////////////////////////////////////////
char *str_BYTE2strBIN(char *str,char value)
{
    return str;
}

/////////////////////////////////////////////////
//преобразует BYTE-число в HEX-строку
//вход:
//value         -число
//выход:
//*str          -HEX-строка
//=str
/////////////////////////////////////////////////
char *str_BYTE2strHEX(char *str,char value)
{
    return str;
}

////////////////////////////////////////////////
//преобразует BYTE-число в DEC-строку
//вход:
//value         -число
//выход:
//*str          -DEC-строка
//=str
////////////////////////////////////////////////
char *str_BYTE2strDEC(char *str,char value)
{
    return str;
}

////////////////////////////////////////////////
//преобразует WORD-число в DEC-строку
//вход:
//value         -число
//выход:
//*str          -DEC-строка
//=str
////////////////////////////////////////////////
char *str_WORD2strDEC(char *str,short value)
{
    return str;
}

////////////////////////////////////////////////
//преобразует DWORD-число в BIN-строку
//вход:
//value         -число
//выход:
//*str          -BIN-строка
//=str
////////////////////////////////////////////////
char *str_DWORD2strBIN(char *str,long value)
{
    return str;
}

////////////////////////////////////////////////
//преобразует DWORD-число в HEX-строку
//вход:
//value         -число
//выход:
//*str          -HEX-строка
//=str
////////////////////////////////////////////////
char *str_DWORD2strHEX(char *s,long value)
{
    return s;
}

////////////////////////////////////////////////
//преобразует DWORD-число в DEC-строку без ведущих нулей(null free)
//вход:
//value         -число
//выход:
//*str          -DEC-строка
//=str
////////////////////////////////////////////////
char *str_DWORD2strDECnf(char *str,long value)
{
    return str;
}

#endif
